#!/usr/bin/env bash
set -euo pipefail
# set -x

shopt -s extglob

export LC_ALL=C

declare -rA MY_REPLACE=(
  [' ']='_' ['!']='_' ['@']='_' ['#']='_' ['$']='_' ['%']='_'
  ['^']='_' ['(']='_' [')']='_' ['-']='_' ['+']='_' ['=']='_'
  ['{']='_' ['}']='_' ['[']='_' [']']='_' [';']='_' [':']='_'
  ['"']='_' ["'"]='_' ['|']='_' ['~']='_' ['<']='_' ['>']='_'
  [',']='_' ['\']='_' ['`']='_'

  ['*']='_' ['?']='_'

  ['&']=' and '

  ["i'm"]='i am'
  ["we're"]='we are'
  ["you're"]='you are'
  ["they're"]='they are'
  ["he's"]='he is'
  ["she's"]='she is'
  ["it's"]='it is'
  ["i'll"]='i will'
  ["you'll"]='you will'
  ["we'll"]='we will'
  ["they'll"]='they will'
  ["he'll"]='he will'
  ["she'll"]='she will'
  ["it'll"]='it will'
  ["let's"]='lets'

  ['ا']='a' ['آ']='a' ['إ']='a' ['أ']='a' ['ب']='b' ['پ']='p' ['ت']='t'
  ['ث']='s' ['ج']='j' ['چ']='ch' ['ح']='h' ['خ']='kh' ['د']='d'
  ['ذ']='z' ['ر']='r' ['ز']='z' ['ژ']='j' ['س']='s' ['ش']='sh'
  ['ص']='s' ['ض']='z' ['ط']='t' ['ظ']='z' ['ع']='a' ['غ']='gh'
  ['ف']='f' ['ق']='gh' ['ک']='k' ['گ']='g' ['ل']='l' ['م']='m'
  ['ن']='n' ['و']='v' ['ه']='h' ['ی']='y' ['ؤ']='o' ['ئ']='y'
  ['ي']='y' ['ة']='h' ['ك']='k'

  ['ä']='ae' ['ö']='oe' ['ü']='ue'
  ['Ä']='ae' ['Ö']='oe' ['Ü']='ue'
  ['ß']='ss'

  ['à']='a' ['â']='a' ['æ']='ae' ['ç']='c' ['é']='e' ['è']='e'
  ['ê']='e' ['ë']='e' ['î']='i' ['ï']='i' ['ô']='o' ['œ']='oe'
  ['ù']='u' ['û']='u' ['ÿ']='y' ['À']='A' ['Â']='A' ['Æ']='AE'
  ['Ç']='C' ['É']='E' ['È']='E' ['Ê']='E' ['Ë']='E' ['Î']='I'
  ['Ï']='I' ['Ô']='O' ['Œ']='OE' ['Ù']='U' ['Û']='U' ['Ÿ']='Y'

  ['á']='a' ['í']='i' ['ó']='o' ['ú']='u' ['ñ']='n' ['ã']='a' ['õ']='o'
  ['Á']='A' ['Í']='I' ['Ó']='O' ['Ú']='U' ['Ñ']='N' ['Ã']='A' ['Õ']=

  ['å']='a' ['ø']='o'
  ['Å']='A' ['Ø']=

  ['ą']='a' ['ć']='c' ['ę']='e' ['ł']='l' ['ń']='n' ['ś']='s' ['ź']='z' ['ż']='z'
  ['Ą']='A' ['Ć']='C' ['Ę']='E' ['Ł']='L' ['Ń']='N' ['Ś']='S' ['Ź']='Z' ['Ż']='Z'
  ['č']='c' ['ď']='d' ['ě']='e' ['ň']='n' ['ř']='r' ['š']='s' ['ť']='t' ['ů']='u' ['ž']='z'
  ['Č']='C' ['Ď']='D' ['Ě']='E' ['Ň']='N' ['Ř']='R' ['Š']='S' ['Ť']='T' ['Ů']='U' ['Ž']='Z'

  ['ğ']='g' ['ı']='i' ['ş']='s'
  ['Ğ']='G' ['İ']='I' ['Ş']='S'

  ['ð']='d' ['þ']='th'
  ['Ð']='D' ['Þ']='Th'
)
readonly MY_TRIM='._-'
readonly MY_DROP=$'.\t\n'

# ______________________________________________________________________________

if [[ "$#" -eq 0 ]];
then
  exit 1
fi

readonly orig="$*"
extn="${orig##*.}"
text="${orig%.*}"

if [[ "$extn" == "$text" ]] && [[ "$extn" == "$orig" ]]; then
  extn=''
fi

# replacements
for key in "${!MY_REPLACE[@]}"; do
  replacement="${MY_REPLACE[${key}]}"
  key="${key//\\/\\\\}"
  key="${key//\*/\\*}"
  key="${key//\?/\\?}"
  key="${key//\[/\\[}"
  text="${text//${key}/${replacement}}"
  extn="${extn//${key}/${replacement}}"
done

# snake case
text="$(sed -E 's/([a-z0-9])([A-Z])/\1_\2/g; s/([A-Z]+)([A-Z][a-z])/\1_\2/g; s/\./_/g' <<< "${text}" | tr '[:upper:]' '[:lower:]')"
extn="$(sed -E 's/([a-z0-9])([A-Z])/\1_\2/g; s/([A-Z]+)([A-Z][a-z])/\1_\2/g; s/\./_/g' <<< "${extn}" | tr '[:upper:]' '[:lower:]')"

# trim end
text="${text##+([${MY_TRIM}])}"
extn="${extn##+([${MY_TRIM}])}"

# trim start
text="${text%%+([${MY_TRIM}])}"
extn="${extn%%+([${MY_TRIM}])}"

# drop
text="${text//[${MY_DROP}]/}"
extn="${extn//[${MY_DROP}]/}"

# ascii only
text="${text//[^A-Za-z0-9._]/}"
extn="${extn//[^A-Za-z0-9._]/}"
extn="${extn//_/}"

while [[ "$extn" == *__* ]]; do
  extn="${extn//__/_}"
done
while [[ "$text" == *__* ]]; do
  text="${text//__/_}"
done

if [[ "$text" == '' ]] && [[ "$extn" == *[^-.]* ]]
then
  echo "$orig"

elif [[ "$extn" == *[^-.]* ]]
then
  echo -n "${text}.${extn}"

else
  echo -n "${text}"
fi

